[
    {
        "category": "Engineering",
        "title": "Native Mobile App Developer",
        "details": {
            "employment_type": "Full-Time",
            "experience": 3,
            "location": "Remote",
            "team_lead": "Sudeep Mishra",
            "what_we_are_looking_for": "We are looking for a qualified Native Mobile Application developer to join our Engineering team. You will be working with our engineers to develop and maintain high quality mobile applications. If you’re passionate about mobile platforms and translating code into user-friendly apps, we would like to meet you. As a Native Mobile App developer, you’ll collaborate with internal teams to develop functional mobile applications, while working in a fast-paced environment.",
            "responsibilites": [
                "Support the entire application lifecycle (concept, design, test, release and support)",
                "Produce fully functional mobile applications writing clean code",
                "Gather specific requirements and suggest solutions",
                "Design interfaces to improve user experience",
                "Liaise with Product development team to plan new features",
                "Ensure new and legacy applications meet quality standards",
                "Research and suggest new mobile products, applications and protocols",
                "Stay up-to-date with new technology trends"
            ],
            "desired_skills": [
                "Proven work experience as a Native Mobile Application developer (React Native, Kotlin, FLutter)",
                "Demonstrable portfolio of released applications on the App store or the Android market",
                "Experience with third-party libraries and APIs",
                "Familiarity with OOP design principles",
                "Excellent analytical skills with a good problem-solving attitude",
                "Ability to perform in a team environment"
            ],
            "recommended": [
                "In-depth knowledge of at least one programming language like Swift and Java",
                "Review code written by other team members.",
                "Collaborate with auditors to ensure code quality standards and security.",
                "Write unit and UI tests to identify malfunctions",
                "Troubleshoot and debug to optimize performance"
            ]
            
        }
    },
    {
        "category": "Designing",
        "title": "Graphic Designer",
        "details": {
            "employment_type": "Full-Time",
            "experience": 3,
            "location": "Remote",
            "team_lead": "Nishu Karna",
            "what_we_are_looking_for": "We are seeking a new graphic designer to join our team. You will be designing a wide variety of things across digital and offline media. To be successful in this position, you’ll be a self-starter, capable of delivering brilliant creative ideas, and show amazing attention to detail.",
            "responsibilites": [
                "Study design briefs and determine requirements",
                "Schedule projects and define budget constraints",
                "Conceptualize visuals based on requirements",
                "Prepare rough drafts and present ideas",
                "Develop illustrations, logos and other designs using software or by hand",
                "Use the appropriate colors and layouts for each graphic",
                "Work with copywriters and creative director to produce final design",
                "Amend designs after feedback",
                "Ensure final graphics and layouts are visually appealing and on-brand"
            ],
            "desired_skills": [
                "Proven graphic designing experience",
                "A strong portfolio of illustrations or other graphics",
                "Familiarity with design software and technologies (such as InDesign, Illustrator, Dreamweaver, Photoshop)",
                "A keen eye for aesthetics and details",
                "Excellent communication skills",
                "Ability to work methodically and meet deadlines"
            ],
            "recommended": [
                "Degree in Design, Fine Arts or related field is a plus",
                "Test graphics across various media",
                "Excellent time management and organisational skills",
                "An understanding of the latest trends and their role within a commercial environment"
            ]
            
        }
    },
    {
        "category": "Designing",
        "title": "Content Writer",
        "details": {
            "employment_type": "Full-Time",
            "experience": 3,
            "location": "Remote",
            "team_lead": "Nishu Karna",
            "what_we_are_looking_for": "We are looking for a Content Writer to join our editorial team and enrich our websites with new blog posts, guides and marketing copy. If you’re familiar with producing online content and have an eye for detail, we’d like to meet you. Feel free to share samples of your work or portfolio of your published articles, along with your application.",
            "responsibilites": [
                "Research industry-related topics (combining online sources, interviews and studies)",
                "Write clear marketing copy to promote products/services",
                "Proofread and edit blog posts before publication",
                "Submit work to editors for input and approval",
                "Coordinate with marketing and design teams to illustrate articles",
                "Conduct simple keyword research and use SEO guidelines to increase web traffic",
                "Identify customers’ needs and gaps in our content and recommend new topics",
                "Ensure all-around consistency (style, fonts, images and tone)"
            ],
            "desired_skills": [
                "Proven work experience as a Content Writer, Copywriter or similar role",
                "Portfolio of published articles",
                "Experience doing research using multiple sources",
                "Familiarity with web publications",
                "Excellent writing and editing skills",
                "Hands-on experience with Content Management Systems (e.g. WordPress)"
            ],
            "recommended": [
                "BSc in Marketing, English, Journalism or related field",
                "Ability to work independently with little or no daily supervision",
                "Strong interpersonal skills and willingness to communicate with clients, colleagues, and management",
                "Ability to work on multiple projects with different objectives simultaneously"
            ]
            
        }
    }
]